src/cf/Catalogs/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СостоянияЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыСостоянийЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОбработкеРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоваяЗадача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СостоянияЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет поставляемые данные.
// 
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	СостояниеЗадачОбъект = Черновик.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Черновик'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Черновик;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаПроверке.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На проверке'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.НаОбработкеРезультата;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Новая.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Новая'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.НоваяЗадача;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = ВРаботе.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'В работе'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.ВРаботе;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаИсполнении.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На исполнении'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.ВРаботе;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаОзнакомлении.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На ознакомлении'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.ВРаботе;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаРассмотрении.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На рассмотрении'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.ВРаботе;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаРегистрации.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На регистрации'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.ВРаботе;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаСогласовании.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На согласовании'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.ВРаботе;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаУтверждении.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На утверждении'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.ВРаботе;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаОбработкеРезультата.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На обработке результата'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.НаОбработкеРезультата;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаОбработкеРезолюции.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На обработке резолюции'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.НаОбработкеРезультата;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаОзнакомленииСРезультатом.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На ознакомлении с результатом'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.НаОбработкеРезультата;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Закрыта.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Закрыта'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Исполнено.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Исполнено'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Ознакомлены.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Ознакомлены'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Принято.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Принято'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Отклонено.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Отклонено'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Рассмотрено.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Рассмотрено'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Зарегистрировано.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Зарегистрировано'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НеЗарегистрировано.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Не зарегистрировано'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Согласовано.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Согласовано'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = СогласованоСЗамечаниями.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Согласовано с замечаниями'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НеСогласовано.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Не согласовано'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Утверждено.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Утверждено'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НеУтверждено.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Не утверждено'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Отложена.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Отложена'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Отложена;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Отменена.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Отменена'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Отменена;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = Подписано.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Подписано'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НеПодписано.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'Не подписано'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.Закрыта;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
	СостояниеЗадачОбъект = НаПодписании.ПолучитьОбъект();
	СостояниеЗадачОбъект.Наименование = НСтр("ru = 'На подписании'");
	СостояниеЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийЗадач.ВРаботе;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеЗадачОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    МультиязычностьСервер.ОбработкаПолученияДанныхВыбора(ДанныеВыбора, 
    	Параметры, СтандартнаяОбработка, Метаданные.Справочники.СостоянияЗадач);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
